<?php
// ========================================================================== //
    function info_module_mod_battles(){
	//Заголовок (на сайте)
	$_module['title']        = 'Битвы титанов';
	//Название (в админке)
	$_module['name']         = 'Битвы титанов';
	//описание
	$_module['description']  = 'Универсальный модуль "Битвы титанов". Можете создавать разные варианты вывода.';
	//ссылка (идентификатор)
	$_module['link']         = 'mod_battles';
	//позиция
	$_module['position']     = 'maintop';
	//автор
	$_module['author']       = 'Рачей';
	//текущая версия
	$_module['version']      = '1.10.3';
	// Настройки по-умолчанию
	$_module['config'] = array();
	return $_module;
}
// ========================================================================== //

    function install_module_mod_battles(){

        return true;

    }

// ========================================================================== //

//    function upgrade_module_mod_games(){

//        return true;
        
//    }

// ========================================================================== //

?>